[
    {
        "name": "Tict",
        "description": "The Technology Impact Cycle Tool helps you to estimate the impact of (new) technology! This tool does that by asking questions. By answering the questions you will gain insight into a lot of facets that are involved in determining the impact of technology. This tool will not tell you what is right or wrong or better. It will help you think about the impact of a (new) technology by asking the right questions so you can make better decisions.",
        "url": "https://tict.joriskorsten.nl",
        "internal": "/projects/1",
        "img": "https://tict.joriskorsten.nl/assets/banner.png",
        "tags": ["development", "design", "research", "communication"],
        "design_description": "At TICT, we were told that they would prefer if we did not stray too far from the current corporate identity. After a preliminary analysis, we saw the following things: a lot of text and looks boring, not inviting.",
        "designing": [
            {
                "paragraph": "We created a first design with a lot less text and a more modern and exciting style. Users could still find all the information they needed by clicking a question mark button.",
                "img": "https://tict.joriskorsten.nl/assets/first-design.png"
            },
            {
                "paragraph": "After this design was made we started thinking about how we could make it more fun and interactive. We came up with the idea of making a kind of game out of it, where you can choose 4 answers per question and sometimes an input field. We also added progression ranks which activates the user's competitive side."
            }
        ],
        "learned": "I picked up building a plain site again without any frameworks, just html, php and css. Because my project partners were not really experienced in programming. I made significant progress in writing CSS. I actually use TailwindCSS these days, because it helps me to set up designs faster than with vanilla CSS.",
        "user_tests": []
    },
    {
        "name": "Gym-Shift",
        "description": "Your Ultimate Fitness Companion! Elevate your fitness journey with the power of personalized workouts. Unleash the full potential of your workouts as you craft your unique exercise schemes and tailor them to your goals.",
        "url": "https://app.gym-shift.com",
        "internal": "/projects/2",
        "img": "https://staging.gym-shift.com/meta_logo.png",
        "tags": ["interactive_media", "development", "design", "research", "communication", "professional_identity"],
        "design_description": "When I started working out, I was assigned several workout plans via the gym's own app by the trainers at the gym. After using the app for a short time, I quickly started thinking about improvements, until at one point I decided that I wanted to make my own gym app.",
        "designing": [
            {
                "paragraph": "Because I was already using the gym's fitness app, I had a bit of an idea of how I wanted the layout to look; simple and easy to use for anyone who goes to the gym. That's why I chose to go with a Material UI style, which gives you simple icons that immediately make it clear what they do without taking up too much space on the screen.",
                "img": ""
            },
            {
                "paragraph": "I immediately got the idea that I might want to make something serious of this, so I also went looking for a domain that was available. Since otherwise it is difficult to come up with a name for the app. After a lot of brainstorming, I came up with 'Gym-Shift'. Which makes me think as if you are in a shift to go to the gym, which I somehow found quite funny. I immediately started thinking of a kind of logo for it, where I thought that shifts alternate, which is why I turned the s and made a kind of switch symbol out of it.",
                "img": "https://staging.gym-shift.com/meta_logo.png"
            },
            {
                "paragraph": "First, I started by creating the login screen. Here I didn't want to have too much on the screen, so I really only started to show the necessary things. Once you are logged in, you will be taken directly to the 'workout' screen, where you will receive the message that you have not yet created a schedule and you can create it via the plus sign in the top right. The remaining screens speak for themselves, but the current app has had a few small UI adjustments, because I still didn't find it quite neat.",
                "img": "https://staging.gym-shift.com/images/design.png"
            }
        ],
        "learned": "I learned a lot from this project, as I had never made a PWA before. I was also able to further develop my skills in TypeScript, as I had always used plain JavaScript with React.",
        "user_tests": [
            {
                "name": "Ruben",
                "gender": "Male",
                "age": "21",
                "job": "Developer",
                "hobbies": "Gym, Gaming",
                "review": "When you try to add an exercise to a workout, the scroll bar is in the buttons with the plus sign. The list of exercises doesn't fully show, so some buttons are not completely visible on my screen. Besides that, I haven't noticed anything else – it's really well done, works easily and quickly."
            },
            {
                "name": "Charlotte",
                "gender": "Female",
                "age": "20",
                "job": "Student applied psychology",
                "hobbies": "Gym, Gaming",
                "review": "Clear app, the workouts you can choose have an explanation of how to perform them, which is very helpful for beginners. Everything is clearly indicated, and the login screen was also easy to use. Additionally, it would be nice to customize your avatar, add images to the workouts, include information about which muscle groups you are targeting, be able to adjust the number of reps, and add deload sets and warming up."
            }
        ]
    }
]