[
    {
        "name": "Portfolio",
        "git": "https://git.fhict.nl/I504610/portfolio",
        "design_url": "",
        "description": "More info about the buildup of my portfolio.",
        "url": "https://portfolio.joriskorsten.nl",
        "internal": "/projects/1",
        "img": "https://tict.joriskorsten.nl/assets/portfolio.png",
        "tags": ["development", "research", "professional_identity"],
        "design_description": "This portfolio was made as a refreshment of my old portfolio. Besides that we got the assignment to make ourselve a professional identity.",
        "designing": [
            {
                "paragraph": "First I started gathering inspiration from other portfolio's. After some searching I found a few that I like, one in particular was the portfolio of Valentina Pastushenko. It was a really clean site with a lot of white space and focus on the content. The whole sit was in black and white with cool hover and cursor effetcs.",
                "img": ""
            }
        ],
        "used_languages": ["React", "TailwindCSS"],
        "learned": "I learned to be critical when making design decisions. Look for typography, match colors, be aware of users with color blindness, etc.",
        "user_tests": []
    },
    {
        "name": "Tict",
        "git": "https://git.fhict.nl/I504610/tict",
        "design_url": "https://www.figma.com/file/KPmz32U7RY7PTw67zcBan2/End-project?type=design&node-id=0%3A1&mode=design&t=Sx5aeUvZowidIUuh-1",
        "description": "The Technology Impact Cycle Tool helps you to estimate the impact of (new) technology! This tool does that by asking questions. By answering the questions you will gain insight into a lot of facets that are involved in determining the impact of technology. This tool will not tell you what is right or wrong or better. It will help you think about the impact of a (new) technology by asking the right questions so you can make better decisions.",
        "url": "https://tict.joriskorsten.nl",
        "internal": "/projects/2",
        "img": "https://tict.joriskorsten.nl/assets/banner.png",
        "tags": ["development", "design", "research", "communication"],
        "design_description": "At TICT, we were told that they would prefer if we did not stray too far from the current corporate identity. After a preliminary analysis, we saw the following things: a lot of text and looks boring, not inviting.",
        "designing": [
            {
                "paragraph": "We created a first design with a lot less text and a more modern and exciting style. Users could still find all the information they needed by clicking a question mark button.",
                "img": "https://tict.joriskorsten.nl/assets/first-design.png"
            },
            {
                "paragraph": "After this design was made we started thinking about how we could make it more fun and interactive. We came up with the idea of making a kind of game out of it, where you can choose 4 answers per question and sometimes an input field. We also added progression ranks which activates the user's competitive side."
            }
        ],
        "used_languages": ["php", "HTML", "CSS"],
        "learned": "I picked up building a plain site again without any frameworks, just html, php and css. Because my project partners were not really experienced in programming. I made significant progress in writing CSS. I actually use TailwindCSS these days, because it helps me to set up designs faster than with vanilla CSS.",
        "user_tests": []
    },
    {
        "name": "Gym-Shift",
        "design_url": "https://www.figma.com/file/NDgI9hAqzINjuF7M8gaCjn/FitPal?type=design&node-id=0%3A1&mode=design&t=1PuhrKWoEslro82l-1",
        "git": "https://git.fhict.nl/I504610/gymshift-frontend",
        "description": "This app was made because I wanted to have my own fitness app where I am free to create my own workout schemes and always be able to edit them to my own liking.",
        "url": "https://app.gym-shift.com",
        "internal": "/projects/3",
        "img": "https://staging.gym-shift.com/meta_logo.png",
        "tags": ["interactive_media", "development", "design", "research", "communication", "professional_identity"],
        "design_description": "When I started working out, I was assigned several workout plans via the gym's own app by the trainers at the gym. After using the app for a short time, I quickly started thinking about improvements, until at one point I decided that I wanted to make my own gym app.",
        "designing": [
            {
                "paragraph": "Because I was already using the gym's fitness app, I had a bit of an idea of how I wanted the layout to look; simple and easy to use for anyone who goes to the gym. That's why I chose to go with a Material UI style, which gives you simple icons that immediately make it clear what they do without taking up too much space on the screen.",
                "img": ""
            },
            {
                "paragraph": "I immediately got the idea that I might want to make something serious of this, so I also went looking for a domain that was available. Since otherwise it is difficult to come up with a name for the app. After a lot of brainstorming, I came up with 'Gym-Shift'. Which makes me think as if you are in a shift to go to the gym, which I somehow found quite funny. I immediately started thinking of a kind of logo for it, where I thought that shifts alternate, which is why I turned the s and made a kind of switch symbol out of it.",
                "img": "https://staging.gym-shift.com/meta_logo.png"
            },
            {
                "paragraph": "First, I started by creating the login screen. Here I didn't want to have too much on the screen, so I really only started to show the necessary things. Once you are logged in, you will be taken directly to the 'workout' screen, where you will receive the message that you have not yet created a schedule and you can create it via the plus sign in the top right. The remaining screens speak for themselves, but the current app has had a few small UI adjustments, because I still didn't find it quite neat.",
                "img": "https://staging.gym-shift.com/images/design.png"
            }
        ],
        "used_languages": ["React", "TypeScript", "Laravel", "MySQL", "TailwindCSS", "php"],
        "learned": "I learned a lot from this project, as I had never made a PWA before. I was also able to further develop my skills in TypeScript, as I had always used plain JavaScript with React. For the backend I made a Laravel API",
        "user_tests": [
            {
                "name": "Ruben",
                "gender": "Male",
                "age": "21",
                "job": "Developer",
                "hobbies": "Fitness, Gaming",
                "review": "When you try to add an exercise to a workout, the scroll bar is in the buttons with the plus sign. The list of exercises doesn't fully show, so some buttons are not completely visible on my screen. Besides that, I haven't noticed anything else – it's really well done, works easily and quickly."
            },
            {
                "name": "Charlotte",
                "gender": "Female",
                "age": "20",
                "job": "Student applied psychology",
                "hobbies": "Fitness, Gaming",
                "review": "Clear app, the workouts you can choose have an explanation of how to perform them, which is very helpful for beginners. Everything is clearly indicated, and the login screen was also easy to use. Additionally, it would be nice to customize your avatar, add videos to the workouts, include information about which muscle groups you are targeting, be able to adjust the number of reps, and add deload sets and warming up."
            },
            {
                "name": "Susan",
                "gender": "Female",
                "age": "26",
                "job": "Front-end developer, was P.E. teacher",
                "hobbies": "Fitness, Gaming, Being with friends",
                "review": "The appearance of the app is very sleek and fits well with a modern fitness app. The logo is appropriate and beautifully designed, showing careful consideration. Upon entering the app, you immediately have a clear user interface (UI). It's not too busy, and you can easily see where you are in the app through the navigation menu at the bottom. Creating a new workout for yourself is simple and fast. After giving it a name, you can choose exercises to include in your workout. I might suggest adding an option to include a custom exercise with a description. Once again, compliments for the clear UI due to the well-thought-out layout, as well as the buttons with text or images for adding or removing items. If you're unsure about something, there's an information button about each exercise. In that information, it might be helpful to add images or a video of the exercise, so users have a visual reference and can perform the exercise correctly. Finally, something often crucial in fitness exercises is a built-in timer, so you don't have to exit the app to set a timer for each exercise. It would be nice if there's an option in the future to input the weight or increase the reps, allowing users to track their progress. Overall, it's a very handy and fast app for creating fitness workouts and keeping track of and saving them."
            },
            {
                "name": "Daniel",
                "gender": "Male",
                "age": "21",
                "job": "Marketeer",
                "hobbies": "Fitness, Music, Cooking",
                "review": "Handy and well-functioning app. However, there are a few features that I miss in order to keep track of my workouts well. It would be useful to be able to add the weight to the set, for example, and also to be able to view your own history. The app itself works quickly and it is very easy to find your way around. In addition, it would also be useful to have an explanation of the exercises, but perhaps it would be more convenient to show an animation or photo here."
            }
        ]
    }
]